app/controllers/stocks_controller.rb

INSERT INTO "stocks" ("ticker", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ticker", "fb"], ["user_id", 2], ["created_at", "2020-10-25 18:55:50.057233"], ["updated_at", "2020-10-25 18:55:50.057233"]]
---
  def create
    @stock = Stock.new(stock_params)

    respond_to do |format|
      if @stock.save

DELETE FROM "stocks" WHERE "stocks"."id" = ?  [["id", 3]]
---
  def destroy
    @stock.destroy

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_stock
      @stock = Stock.find(params[:id])